/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "לא ניתן היה להשלים את הפעולה";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "ארעה שגיאה לא ידועה (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "לא ניתן להשלים את הפעולה";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "‏נסה/י שוב מאוחר יותר.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "לא ניתן להקליט";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "נסה/י להקליט שוב.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "לא ניתן להקליט";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "עצור/י פעולות אחרות באמצעות ה%@ ונסה/י שוב."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "לא ניתן להקליט";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "נסה/י להקליט שוב.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "נסה/י להקליט שוב.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "אין מספיק מקום בכדי להמשיך בשמירת הקובץ. מחק/י סרטונים או תמונות על-מנת לפנות מקום.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "נסה/י להקליט שוב.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "נסה/י להקליט שוב.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "ההקלטה הגיעה לאורך המותר המירבי."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "ההקלטה הגיעה לגודל הקובץ המותר המירבי."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "עצור/י פעולות אחרות באמצעות התקן ההקלטה ונסה/י שוב.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "ההקלטה הגיעה לאורך המותר המירבי."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "לא ניתן להקליט";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "נסה/י להקליט שוב.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "לא ניתן להשתמש ב%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "עצור/י פעולות אחרות באמצעות ה%@ ונסה/י שוב."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "לא ניתן להשתמש ב%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "עצור/י פעולות אחרות באמצעות ה%@ ונסה/י שוב."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "ההקלטה נעצרה";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "עצור/י פעולות אחרות באמצעות התקן ההקלטה ונסה/י שוב.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "לא ניתן להפעיל את הפנס.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "נסה/י להפעיל את הפנס ברמה נמוכה יותר.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "לא ניתן להשלים את הפעולה";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "‏נסה/י שוב מאוחר יותר.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "לא ניתן להשלים את הפעולה";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "נסה/י לייצא שוב.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "הפענוח נכשל";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "לא ניתן היה לפענח את המדיה. יתכן שהיא פגומה.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "סוג מדיה זה אינו נתמך.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "לא ניתן לשמור";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "נסה/י לשמור שוב.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "לא ניתן לכתוב את קובץ הפלט";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "שנה/י את הסיומת ונסה/י שוב.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "לא ניתן להשתמש במדיה זו.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "לא ניתן להשתמש במדיה זו.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "לא ניתן להשתמש במדיה זו.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "לא ניתן להשתמש במדיה זו.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "סוג מדיה זה אינו נתמך.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "יתכן שהמדיה פגומה.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "לא ניתן לצלם";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "נסה/י לצלם שוב.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "פעולה זו אינה נתמכת עבור תוכן מוגן."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "אין לך הרשאה לתוכן זה."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "ליישום זה אין הרשאה לנגן קובץ זה."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "לא ניתן להשתמש במדיה זו.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "הפענוח נכשל";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "ערכת הפענוח הנדרשת לפענוח מדיה זו לא נמצאה.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "הקידוד נכשל";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "ערכת הקידוד הנדרשת לפענוח מדיה זו לא נמצאה.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "הפענוח נכשל";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "ערכת הפענוח הנדרשת למדיה זו בשימוש.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "עצור/י פעולות אחרות הקשורות לפענוח מדיה ונסה/י שוב.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "הקידוד נכשל";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "ערכת הקידוד הנדרשת לשימוש במדיה זו בשימוש.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "עצור/י פעולות אחרות הקשורות לקידוד מדיה ונסה/י שוב.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "לא ניתן להשתמש ב%@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "יישום הפועל ברקע אינו רשאי להשתמש ב-״%@״."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "פעולה זו אינה נתמכת עבור מדיה זו.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "לא ניתן להרכיב את הסרט לפני ההוראות שסופקו.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "לא ניתן להשתמש במדיה זו.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "לא ניתן להשתמש בקובץ המטמון בכתובת היעד של ההורדה.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "סכום הביקורת של קובץ זה אינו תקין.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "הפעולה נקטעה";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "הפסק/י פעולות אחרות ונסה/י שוב.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "הפתיחה נכשלה";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "לא ניתן להשתמש במדיה בהתקן זה.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "יתכן שהמדיה פגומה.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "הפעולה הופסקה";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "תצורת השרת שגויה.";
